import random

print("მოგესალმებათ შემთხვევითი რიცხვის გენერატორი!")

num1 = float(input("შეიყვანეთ პირველი რიცხვი: "))
num2 = float(input("შეიყვანეთ მეორე რიცხვი: "))


if num1 == num2:
    print("აუცილებლად უნდა იყოს ერთმანეთისაგან განსხვავებული!")
    try:
        num1 = float(input("შეიყვანეთ პირველი რიცხვი: "))
        num2 = float(input("შეიყვანეთ მეორე რიცხვი: "))
    except:
        print("აუცილებელია, რომ შეიყვანოთ ციფრი და არა ასო")


while num1 == 00 and num2 == 00:
    print("აუცილებელია, რომ მეორე ციფრი იყოს მეტი 0-ზე! ")
    try:
        num1 = float(input("შეიყვანეთ პირველი რიცხვი: "))
        num2 = float(input("შეიყვანეთ მეორე რიცხვი: "))
    except:
        print("აუცილებელია, რომ შეიყვანოთ ციფრი და არა ასო")

while num1 > num2:
    print(f"აუცილებელია, რომ მეორე რიცხვი იყოს მეტი {num1.__round__()}-ზე!")
    try:
        num1 = float(input("შეიყვანეთ პირველი რიცხვი: "))
        num2 = float(input("შეიყვანეთ მეორე რიცხვი: "))
    except:
        print("აუცილებელია, რომ შეიყვანოთ ციფრი")


if num1 < num2:
    print("თქვენი შემთხვევითი რიცხვი არის -", (random.randrange(num1, num2)))
    print("მადლობას გიხდით იმისათვის, რომ სარგებლობთ ჩვენი გენერატორით")
